In [1]:
import numpy as np
import pandas as pd
from pandas import Series,DataFrame

from numpy.random import randn

In [2]:
ser1 = Series([1,2,3,4],index=['A','B','C','D'])

In [3]:
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [4]:
ser2 = ser1.reindex(['A','B','C','D','E','F'])

In [5]:
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [6]:
ser2.reindex(['A','B','C','D','E','F','G'],fill_value=0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [7]:
ser3 = Series(['USA','Mexico','Canada'],index=[0,5,10])

In [8]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [9]:
ranger = range(15)

In [18]:
ranger

range(0, 15)

In [19]:
ser3.reindex(ranger,method="ffill")

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [20]:
## ffill = forward fill

In [21]:
dframe = DataFrame(randn(25).reshape((5,5)),index=['A','B','D','E','F'],columns=['col1','col2','col3','col4','col5'])

dframe

       col1      col2      col3      col4      col5
A -0.105488 -1.213871 -0.894346 -0.565934  0.365401
B -1.271321  0.475517  0.965719 -2.573064 -0.608649
D -1.092731 -1.402634  0.073849  1.495185  2.257787
E  0.253233  0.694210 -1.638310 -0.156724 -0.620582
F -0.433213 -0.104957 -0.634475 -0.843889  0.312258

In [22]:
dframe2 = dframe.reindex(['A','B','C','D','E','F'])

In [23]:
dframe2

       col1      col2      col3      col4      col5
A -0.105488 -1.213871 -0.894346 -0.565934  0.365401
B -1.271321  0.475517  0.965719 -2.573064 -0.608649
C       NaN       NaN       NaN       NaN       NaN
D -1.092731 -1.402634  0.073849  1.495185  2.257787
E  0.253233  0.694210 -1.638310 -0.156724 -0.620582
F -0.433213 -0.104957 -0.634475 -0.843889  0.312258

In [24]:
new_columns = ['col1','col2','col3','col4','col5','col6']

In [25]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.105488 -1.213871 -0.894346 -0.565934  0.365401   NaN
B -1.271321  0.475517  0.965719 -2.573064 -0.608649   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.092731 -1.402634  0.073849  1.495185  2.257787   NaN
E  0.253233  0.694210 -1.638310 -0.156724 -0.620582   NaN
F -0.433213 -0.104957 -0.634475 -0.843889  0.312258   NaN

In [26]:
dframe2.reindex(columns=new_columns)

       col1      col2      col3      col4      col5  col6
A -0.105488 -1.213871 -0.894346 -0.565934  0.365401   NaN
B -1.271321  0.475517  0.965719 -2.573064 -0.608649   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.092731 -1.402634  0.073849  1.495185  2.257787   NaN
E  0.253233  0.694210 -1.638310 -0.156724 -0.620582   NaN
F -0.433213 -0.104957 -0.634475 -0.843889  0.312258   NaN

In [21]:
dframe

       col1      col2      col3      col4      col5
A  1.075136  3.104814 -0.669309 -0.975515  0.073327
B  0.383137  0.718532 -0.695935 -0.709268  0.364908
D -0.128174 -1.667044  2.047182 -0.890297 -0.485105
E  1.197239  0.105591 -1.102544  1.386982  0.955729
F  1.653688 -1.632098  0.611806 -1.105300 -0.862595

In [27]:
dframe.loc[['A','B','C','D','E','F'],new_columns]

       col1      col2      col3      col4      col5  col6
A  1.075136  3.104814 -0.669309 -0.975515  0.073327   NaN
B  0.383137  0.718532 -0.695935 -0.709268  0.364908   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -0.128174 -1.667044  2.047182 -0.890297 -0.485105   NaN
E  1.197239  0.105591 -1.102544  1.386982  0.955729   NaN
F  1.653688 -1.632098  0.611806 -1.105300 -0.862595   NaN

In [23]:
dframe

       col1      col2      col3      col4      col5
A  1.075136  3.104814 -0.669309 -0.975515  0.073327
B  0.383137  0.718532 -0.695935 -0.709268  0.364908
D -0.128174 -1.667044  2.047182 -0.890297 -0.485105
E  1.197239  0.105591 -1.102544  1.386982  0.955729
F  1.653688 -1.632098  0.611806 -1.105300 -0.862595